In [1]:
import pandas as pd

In [3]:
Country={"City":["London", "Birmingham", "Manchester", "Bradford", "Liverpool"],
        "Code":["LN", "BM", "MN", "BD", "LP"]
        }

In [5]:
Country

{'City': ['London', 'Birmingham', 'Manchester', 'Bradford', 'Liverpool'],
 'Code': ['LN', 'BM', 'MN', 'BD', 'LP']}

In [6]:
df=pd.DataFrame(Country, columns=["City", "Code"])

In [7]:
df

         City Code
0      London   LN
1  Birmingham   BM
2  Manchester   MN
3    Bradford   BD
4   Liverpool   LP

In [8]:
#now suppose i want to delete 0th row and 4th rows

In [9]:
df=df.drop([0,4])

In [10]:
df

         City Code
1  Birmingham   BM
2  Manchester   MN
3    Bradford   BD

In [13]:
df=df.reset_index(drop=True)

In [12]:
df

         City Code
1  Birmingham   BM
2  Manchester   MN
3    Bradford   BD

In [14]:
df

         City Code
0  Birmingham   BM
1  Manchester   MN
2    Bradford   BD